---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCannotExtendToFloorStructureLayerWarning
source: html/b6e13627-cd66-ee2b-4b93-bc9de08b5a2a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCannotExtendToFloorStructureLayerWarning Property

Stairs cannot extend to floor structure layer.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsCannotExtendToFloorStructureLayerWarning { get; }
```